// Задача 11 HARD - необязательная: Напишите программу, 
// которая принимает на вход целое число любой разрядности число и удаляет вторую цифру слева направо этого
// числа. И, конечно же, через строку решать нельзя.

int x = new Random().Next(1, 1000000);

{
  int x = 10;
  int* p = &x;
  cout << "Address of i: " << p << endl;
  cout << "Value of i: " << *p << endl; 
}
