// Задача 26. - HARD необязательная Напишите программу, которая принимает на 
// вход целое или дробное число и выдаёт количество цифр в числе.

// 452 -> 3
// 82 -> 2
// 9,012 ->4

// Console.WriteLine("Введите любое число, ");
// double n = Convert.ToInt32 (Console.ReadLine());
// int NumLen = (int)Math.Log10(n) + 1;
// Console.WriteLine($"Количество цифр в числе до запятой,  {NumLen}");

